validation/AMR/scalarTransport/LES/STD/3D_IDDES/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 74.20869;

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    crossflow
    {
        type            fixedValue;
        value           uniform 74.20869;
    }
    jet
    {
        type            fixedValue;
        value           uniform 19421.42726;
    }
    outlet
    {
        type            zeroGradient;
    }
    front
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
    back
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
    bottom
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
    top
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
    pipe
    {
        type            omegaWallFunction;
        value           uniform 1e8;
    }
}

// ************************************************************************* //
