validation/AMR/scalarTransport/LES/STD/3D_IDDES/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  LES;

LES
{
    LESModel		SpalartAllmarasIDDES;
    turbulence		on;
    printCoeffs		on;
    delta		IDDESDelta;

    IDDESDeltaCoeffs
    {
        hmax		cubeRootVol;
        cubeRootVolCoeffs
        {
            deltaCoeff      1;
        }
    }
}

// ************************************************************************* //
