validation/AMR/scalarTransport/LES/STD/3D_IDDES/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     	scalarPimpleFoam;

startFrom       	latestTime;

startTime       	0;

stopAt          	endTime;

endTime         	1;

deltaT          	0.000003;

writeControl    	adjustableRunTime;

writeInterval   	0.001;

purgeWrite      	0;

writeFormat     	ascii;

writePrecision		8;

writeCompression	off;

timeFormat      	general;

timePrecision   	8;

runTimeModifiable	yes;

adjustTimeStep		no;

maxCo           	0.9;

maxDeltaT       	0.01;

libs 
(
);

functions
{
	#includeFunc	criteria
	#includeFunc	fieldAverage(U, p, c, prime2Mean=yes)
	#includeFunc	U_sampling
	#includeFunc	c_sampling
}

// ************************************************************************* //
