validation/AMR/scalarTransport/LES/STD/3D_IDDES/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
	default			backward;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default								none;
	div(phi,U)							Gauss LUST grad(U);
	div(phi,nuTilda)						Gauss LUST grad(U);
	div(phi,c)							Gauss linearUpwind grad(c);
    div((nuEff*dev2(T(grad(U)))))		Gauss linear;
}

laplacianSchemes
{
    default			Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

wallDist
{
    method	    	meshWave;
}

// ************************************************************************* //
