validation/AMR/scalarTransport/LES/STD/3D_IDDES/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    pcorr
    {
        solver					GAMG;
        smoother				GaussSeidel;
        tolerance       		1e-05;
        relTol          		0;
    }

    pcorrFinal
    {
        $pcorr;
        relTol          		0;
    }

    p
    {
        solver					GAMG;
        smoother				GaussSeidel;
        tolerance               1e-05;
        relTol                  0.01;
    }

    pFinal
    {
        $p;
        relTol          		0;
    }

    U
    {
        solver          		smoothSolver;
        smoother        		symGaussSeidel;
        tolerance       		1e-08;
        relTol          		0.1;
    }

    UFinal
    {
        $U;
        relTol          		0;
    }

    nuTilda
    {
        solver          		smoothSolver;
        smoother        		symGaussSeidel;
        tolerance       		1e-08;
        relTol          		0.1;
    }

    nuTildaFinal
    {
        $nuTilda;
        relTol          		0;
    }

    c
    {
        solver          		smoothSolver;
        smoother        		symGaussSeidel;
        tolerance       		1e-12;
        relTol          		0;
        minIter					1;
    }

    cFinal
    {
        $c;
        relTol          		0;
    }
}

PIMPLE
{
    nOuterCorrectors			1;
    nCorrectors                 3;
    nNonOrthogonalCorrectors	0;
}

relaxationFactors
{
    fields
    {
        ".*"					1.0;
    }
    equations
    {
        ".*"					1.0;
    }
}

// ************************************************************************* //
